emacs/init.org
#+PROPERTY: header-args:emacs-lisp :tangle init.el

* Headers
#+BEGIN_SRC emacs-lisp
    ;;;; Uncle Béla's Emacs config
    ;;; Author: Uncle Béla
#+END_SRC

* Debugging (in case it's needed)
#+BEGIN_SRC emacs-lisp
(setq debug-on-error nil) ;; Change to t, when in doubt
#+END_SRC

* Package Management
First of all, we will add MEPLA as a repository, thus, it will unlock us many other packages that are handy.
#+begin_src emacs-lisp
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (package-initialize)
#+end_src

* Bootstrap straight.el
#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name
	  "straight/repos/straight.el/bootstrap.el"
	  (or (bound-and-true-p straight-base-dir)
	      user-emacs-directory)))
	(bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

* Loading Packages
#+begin_src emacs-lisp
  (require 'ox-texinfo)
#+end_src

* UB Settings
** Light Mode
#+begin_src emacs-lisp
  (defun ub/lightmode ()
    "Activate Light Mode"
    (interactive)
    (set-face-attribute 'default nil :foreground "black" :background "#faf7ee")
    (set-face-attribute 'fringe nil :background "#faf7ee")
    (set-cursor-color "#2a9b00")

    (set-face-attribute 'region nil :background "#b3b3b3")
    (set-face-attribute 'highlight nil :background "#dbdbdb")
    (set-face-background 'hl-line "#dbdbdb")
    (set-face-foreground 'font-lock-function-name-face "MediumVioletRed")     
    (set-face-foreground 'font-lock-string-face "#be3c16")
    (set-face-foreground 'org-level-1 "DodgerBlue")
    (set-face-foreground 'org-level-2 "LimeGreen")
    (set-face-foreground 'org-level-3 "LightSeaGreen")
    "white"
    (set-frame-parameter nil 'alpha-background 100)
    (add-to-list 'default-frame-alist '(alpha-background . 100))
    (set-face-foreground 'line-number-current-line "#338b41")

    (set-face-attribute 'font-lock-comment-face nil :foreground "#3d3d3d")

    ;; ---

    (set-face-foreground 'org-block "#00007f")
    (set-face-background 'org-block "#ccc9c0")

    (set-face-foreground 'org-block-begin-line "#545454")
    (set-face-background 'org-block-begin-line "#b3afa6")

    (set-face-foreground 'org-block-end-line "#545454")
    (set-face-background 'org-block-end-line "#b3afa6")

    (set-face-attribute 'font-lock-keyword-face nil :foreground "#087e1b")

    ;; ----

    (set-face-attribute 'mode-line nil
                        :background "#334455") ; #334455: Dark Blue

    ;; Customize the default mode line faces for your lambda line
    (set-face-attribute 'mode-line nil
                        :background "#d1d1d1"  ; Dark background color
                        :foreground "#000000"  ; Light text color
                        )

    (set-face-attribute 'mode-line-inactive nil
                        :background "#d1d1d1"  ; Dark background color
                        :foreground "#000000") ; Light text color
    )
#+end_src
** Dark Mode
#+begin_src emacs-lisp
  (defun ub/darkmode ()
    "Activate Dark Mode"
    (interactive)
    (set-face-attribute 'region nil :background "#757474")
    (set-face-attribute 'highlight nil :background "#262626")
    (set-face-attribute 'fringe nil :background "#1a181b")
    (set-face-background 'hl-line "#454545")
    (set-face-attribute 'default nil :foreground "white" :background "#1a181b")
    (set-face-foreground 'org-level-1 "#F05941")
    (set-face-foreground 'org-level-2 "#BE3144")
    (set-face-foreground 'org-level-3 "#872341")
    (set-face-foreground 'org-level-4 "#94485f")
    (set-face-foreground 'org-link "#2e8bf0")
    (set-frame-parameter nil 'alpha-background 100)
    (add-to-list 'default-frame-alist '(alpha-background . 100))
    (set-face-foreground 'line-number-current-line "#ffe600") 

    (set-face-attribute 'font-lock-comment-face nil :foreground "#ffe600")

    (set-face-attribute 'mode-line nil
                        :background "#000000"  ; Dark background color
                        :foreground "#ffffff"  ; Light text color
                        )


    (set-face-attribute 'mode-line-inactive nil
                        :background "#000000"  ; Dark background color
                        :foreground "#ffffff") ; Light text color

    ;; ---------

    (set-face-foreground 'org-block "#ffffff")
    (set-face-background 'org-block "#0f0f0f")
    (set-face-foreground 'org-block-begin-line "#cc0433")
    (set-face-background 'org-block-begin-line "#141414")
    (set-face-foreground 'org-block-end-line "#cc0433")
    (set-face-background 'org-block-end-line "#141414")
    (set-face-attribute 'font-lock-keyword-face nil :foreground "#ffc400")    


    ;; --------x

    (set-face-attribute 'mode-line nil
                        :background "#334455") ; #334455: Dark Blue

    ;; Customize the default mode line faces for your lambda line
    (set-face-attribute 'mode-line nil
                        :background "#141414"  ; Dark background color
                        :foreground "#ffffff"  ; Light text color
                        )

    (set-face-attribute 'mode-line-inactive nil
                        :background "#141414"  ; Dark background color
                        :foreground "#ffffff") ; Light text color
    )
#+end_src

** Global UI Values
#+BEGIN_SRC emacs-lisp
(set-face-foreground 'org-meta-line "#00781a")
#+END_SRC

** Transparent Emacs
#+begin_src emacs-lisp
  (defun ub/tp ()
    (interactive)
    (set-frame-parameter nil 'alpha-background 80)
    (add-to-list 'default-frame-alist '(alpha-background . 80))    
    )
#+end_src   

** Custom Keybindings
#+begin_src emacs-lisp
  (global-set-key (kbd "M-j") 'copy-line-down)
  (global-set-key (kbd "M-k") 'copy-line-up)
  (global-set-key (kbd "C-j") 'move-line-down)
  (global-set-key (kbd "C-k") 'move-line-up)
  (global-set-key (kbd "C-z") 'undo-only)
  (global-set-key (kbd "C-u") 'undo-redo)
  (global-set-key (kbd "C-x u") 'universal-argument)

  (global-set-key (kbd "C-c q") 'indent-region)
  (global-set-key (kbd "C-c c") 'comment-dwim)
  (global-set-key (kbd "C-c e") 'eval-buffer)
  (global-set-key (kbd "C-c r") 'replace-regexp)  

  (global-set-key (kbd "C-c l") 'org-open-at-point)
#+end_src

* UI Enhancements: Fonts and Colors
Next up, we will customize our fonts and colors here, additionally, we will add syntax highlighting and more.
** UI Enhancements: Fonts and Colors
#+begin_src emacs-lisp
  (global-hl-line-mode 1)

  (set-face-attribute 'default nil :font "Iosevka Nerd Font Mono-18")

  ;;;; Light Mode
  (ub/lightmode)

  ;; Dark Mode
  ;; (ub/darkmode)

  ;; Transparent Mode
  ;; (ub/tp)

  (add-hook 'server-after-make-frame-hook
            (lambda ()
              (set-frame-font "Iosevka Nerd Font Mono-18")))

#+end_src

** UI Enhancements: Syntax Highlighting
#+begin_src emacs-lisp
  (set-face-attribute 'font-lock-delimiter-face nil :foreground "#ffe600")
  (set-face-attribute 'org-meta-line nil :foreground "#e69a37")    
  (set-face-attribute 'font-lock-type-face nil :foreground "#66D9EF")
  (set-face-attribute 'font-lock-variable-name-face nil :foreground "#FD971F")
  (set-face-attribute 'font-lock-constant-face nil :foreground "#AE81FF")
#+end_src

* LSP Configuration
#+begin_src emacs-lisp
  (use-package lsp-mode
    :ensure t
    :commands lsp
    :hook ((bash-mode . lsp)
           (python-mode . lsp)
           (julia-mode . lsp)
           (html-mode . lsp)
           (css-mode . lsp)
           (js-mode . lsp)
           (typescript-mode . lsp)
           (sh-mode . lsp)
           (c-mode . lsp)
           (c++-mode . lsp))
    :custom
    (lsp-headerline-breadcrumb-enable nil)
    (lsp-completion-provider :capf)  ; Common setting for completion
    (lsp-clients-clangd-executable "/usr/bin/clangd"))

  (use-package lsp-ui
    :ensure t
    :commands lsp-ui-mode)

  (use-package company
    :ensure t
    :config
    (setq company-idle-delay 0.2
          company-minimum-prefix-length 1)
    (global-company-mode t))

  (use-package yasnippet
    :ensure t
    :config
    (yas-global-mode 1))

  (use-package yasnippet-snippets
    :ensure t)

  (use-package flycheck
    :ensure t
    :init (global-flycheck-mode))

  (use-package which-key
    :ensure t
    :config
    (which-key-mode))
#+end_src

* Major Modes and Packages
Set up various major modes and additional packages.
** Magit
#+begin_src emacs-lisp
  (use-package magit :ensure t)
#+end_src

