emacs/init.org
** Org Mode
#+begin_src emacs-lisp
  (use-package org :ensure t)
#+end_src

** Org Mode Folds
#+begin_src emacs-lisp
  (setq org-startup-folded t)
#+end_src

** Org Indent Mode
#+BEGIN_SRC emacs-lisp
  (setq org-startup-indented t)
#+END_SRC

** Org LaTeX support
#+begin_src emacs-lisp
  (setq org-pretty-entities t)
#+end_src

** Org Bullets
#+begin_src emacs-lisp
  (use-package org-bullets
    :ensure t)
  (add-hook 'org-mode-hook 'org-bullets-mode)  
#+end_src

** Org Mode Descriptive Links
#+begin_src emacs-lisp
  (setq org-descriptive-links t)
  (global-set-key (kbd "C-c o") 'org-toggle-link-display)
#+end_src

** Org Mode Other Settings
#+begin_src emacs-lisp
  ;; Replace "Table of Contents" text with "Contents"
  (defun replace-toc-title (backend)
    (when (org-export-derived-backend-p backend 'html)
      (save-excursion
        (goto-char (point-min))
        (while (re-search-forward "Table of Contents" nil t)
          (replace-match "Contents")))))

  (add-hook 'org-export-before-processing-hook 'replace-toc-title)
#+end_src 

** Emacs-Jupyter interface
#+BEGIN_SRC emacs-lisp
  (use-package "jupyter" :ensure t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (require 'ob-jupyter)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((jupyter . t)  ;; Enable Jupyter support
     (emacs-lisp . t)
     (python . t)
     (julia . t)))  ;; Enable Julia language support

#+END_SRC

** Godot - GDScript Mode
#+begin_src emacs-lisp
  (use-package gdscript-mode
    :straight (gdscript-mode
               :type git
               :host github
               :repo "godotengine/emacs-gdscript-mode"))
#+end_src 

** Ivy and Counsel
#+begin_src emacs-lisp
  (unless (package-installed-p 'counsel)
    (package-refresh-contents)
    (package-install 'counsel))

  (unless (package-installed-p 'ivy)
    (package-refresh-contents)
    (package-install 'ivy))

  (unless (package-installed-p 'ivy-rich)
    (package-refresh-contents)
    (package-install 'ivy-rich))


  (require 'ivy)
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t)
  (setq ivy-height 10)
  (setq ivy-display-style 'fancy)
  (setq ivy-re-builders-alist '((t . ivy--regex-ignore-order)))

  ;; Disabling ido mode to disable jankiness in buffer menus and file menus
  (ido-mode -1)

  ;; Ivy-rich configuration
  (require 'ivy-rich)
  (ivy-rich-mode 1)

  ;; Use counsel for better integration
  (require 'counsel)
  (counsel-mode 1)

  (setq ivy-format-function 'ivy-format-function-line)
#+end_src

** Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :config
    (projectile-mode +1)
    :bind-keymap
    ("C-c p" . projectile-command-map))
#+end_src

** Flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :ensure t
    :init
    (global-flycheck-mode))
#+end_src

** Nerd Icons and All The Icons
#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons :ensure t)  
  (use-package nerd-icons :ensure t)

  (use-package all-the-icons-dired :ensure t)  
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)

  (setq lsp-modeline-code-action-fallback-icon "💡")  
#+END_SRC

** Writeroom - Center buffer text
#+BEGIN_SRC emacs-lisp
  (use-package writeroom-mode :ensure t)
#+end_src     
#+END_SRC
** Windresize
#+begin_src emacs-lisp
  (use-package windresize :ensure t)
#+end_src

** Org Roam with UI
#+begin_src emacs-lisp
  (use-package websocket :ensure t)
  (use-package simple-httpd :ensure t)
  (use-package f :ensure t)
  (use-package org-roam-ui :ensure t)
  (use-package org-roam
    :ensure t
    :custom
    (org-roam-directory (file-truename "/home/anon/Projects/Personal/org-files/"))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n g" . org-roam-graph)
           ("C-c n i" . org-roam-node-insert)
           ("C-c n c" . org-roam-capture)
           ;; Dailies
           ("C-c n j" . org-roam-dailies-capture-today))
    :config
    ;; If you're using a vertical completion framework, you might want a more informative completion interface
    (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    (org-roam-db-autosync-mode)
    ;; If using org-roam-protocol
    (require 'org-roam-protocol))
#+end_src

** Fireplace
#+begin_src emacs-lisp
  (use-package fireplace :ensure t)

  (defun my-disable-line-numbers-in-fireplace ()
    "Disable line numbers in Fireplace."
    (when (eq major-mode 'fireplace-mode)
      (display-line-numbers-mode -1)))
#+end_src

#+BEGIN_SRC emacs-lisp
  (add-hook 'fireplace-mode-hook (lambda () (display-line-numbers-mode -1)))
#+END_SRC

** Multiple Cursors
#+begin_src emacs-lisp
  (use-package multiple-cursors
    :ensure t
    :bind (("C-c m <down>" . mc/mark-next-lines)
           ("C-c m <up>" . mc/mark-previous-lines)
           ("C-c m n" . mc/mark-next-like-this)
           ("C-c m p" . mc/mark-previous-like-this)
           ("C-c m a" . mc/mark-all-like-this)))

  (setq mc/cmds-to-run-for-all nil)
#+end_src

** Tab indentations
#+begin_src emacs-lisp
  (setopt indent-tabs-mode nil)
  (setopt tab-width 4)
  (setq-default indent-tabs-mode nil)
  (setq standard-indent 4)
  (setq c-basic-offset 4)
#+end_src

** Undo-tree
#+BEGIN_SRC emacs-lisp
  (use-package undo-tree :ensure t)
#+END_SRC
   
* Additional Configurations
Include miscellaneous settings and functions.
** Line Numbering
#+begin_src emacs-lisp
  (setq display-line-numbers-type 'relative)
  (defun toggle-line-numbering-type ()
    "Toggle between relative and absolute line numbering."
    (interactive)
    (setq display-line-numbers-type
          (if (eq display-line-numbers-type 'relative)
              'absolute
            'relative))
    (global-display-line-numbers-mode -1) ; Turn off
    (global-display-line-numbers-mode 1)) ; Turn on
  (global-set-key (kbd "C-x a q") 'toggle-line-numbering-type)
  (global-set-key (kbd "C-x a w") 'display-line-numbers-mode)  
#+end_src

** Move and Copy Current Line Above And Below
#+begin_src emacs-lisp
  (defun copy-line-up ()
    "Copy the current line and paste it above the current line, and remain on the copied line."
    (interactive)
    (let ((current-line (thing-at-point 'line)))
      ;; Copy and paste the line immediately below
      (move-beginning-of-line 1)
      (kill-line)
      (yank)
      (newline)
      (yank)
      (forward-line -1)))

  (defun copy-line-down()
    (interactive)
    (move-beginning-of-line 1)
    (kill-line)
    (yank)
    (open-line 1)
    (next-line 1)
    (yank)
    )

  (defun move-line-up ()
    "Move the current line up by one."
    (interactive)
    (transpose-lines 1)
    (previous-line 2))

  (defun move-line-down ()
    "Move the current line down by one."
    (interactive)
    (next-line 1)
    (transpose-lines 1)
    (previous-line 1))
#+end_src

** Windmove keybinds
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c C-<left>")  'windmove-left)
  (global-set-key (kbd "C-c C-<right>") 'windmove-right)
  (global-set-key (kbd "C-c C-<up>")    'windmove-up)
  (global-set-key (kbd "C-c C-<down>")  'windmove-down)
#+end_src

** Bracket completion
#+begin_src emacs-lisp
  (electric-pair-mode t)
#+end_src

** st (suckless terminal) completion
#+begin_src emacs-lisp
  (defun open-terminal-in-current-directory ()
    "Open a terminal in the current directory using `st` and also disown it."
    (interactive)
    (let ((current-directory (expand-file-name default-directory)))
      (start-process-shell-command
       "st" nil
       (concat "setsid st -e sh -c 'cd " current-directory " && exec $SHELL'"))))
  (global-set-key (kbd "C-c t") 'open-terminal-in-current-directory)
#+end_src

** Windresize keybindings
#+begin_src emacs-lisp
  (global-set-key (kbd "s-r") 'windresize) ; This is nice.
#+end_src

** Stop creating ~ and # files
#+begin_src emacs-lisp
  (setq backup-directory-alist
        `((".*" . ,temporary-file-directory)))
  (setq auto-save-file-name-transforms
        `((".*" ,temporary-file-directory t)))
  (setq make-backup-files nil) ; stop creating ~ files
#+end_src

** Opening new buffers in the same window
#+begin_src emacs-lisp
  (setq display-buffer-alist
        '((".*" (display-buffer-same-window))))
#+end_src

** Quickly open encyclopedia.org
#+begin_src emacs-lisp
  (global-set-key (kbd "<f6>") (lambda () (interactive)
                                 (find-file "/home/anon/Projects/Personal/org-files/index.org")
                                 (message: "Opened %s" (buffer-name))))
#+end_src

** Quickly open init.org
#+begin_src emacs-lisp
  (global-set-key (kbd "<f5>") (lambda () (interactive)
                                 (find-file "/home/anon/.emacs.d/init.org")
                                 (message: "Opened %s" (buffer-name))))
#+end_src

** Additional info files directory
#+begin_src emacs-lisp
  (setq Info-default-directory-list
        (append '("/usr/share/info")
                Info-default-directory-list
                '("~/.emacs.d/info")))
#+end_src

