emacs/init.org
** Open new file in a new frame
#+begin_src emacs-lisp
  (defun my-open-file-in-new-buffer ()
    "Open the file at point in a new buffer."
    (interactive)
    (let ((file (org-element-property :path (org-element-context))))
      (if file
          (find-file file)
        (message "No file at point"))))

  (define-key org-mode-map (kbd "C-c C-o") 'my-open-file-in-new-buffer)
#+end_src 

** Unbind freeze buffer keybind
#+begin_src emacs-lisp
  (global-unset-key (kbd "C-x C-z"))
#+end_src

* Ivy and Yasnippet
#+begin_src emacs-lisp
  (defun ivy-my-yasnippet ()
    "Custom yasnippet selection with ivy from ~/.emacs.d/snippets dir"
    (interactive)
    (let* ((yas-snippet-dirs '("~/.emacs.d/snippets")) ; Default *snippets* directory
           (choices (yas--all-templates (yas--get-snippet-tables)))
           (my-snippets (seq-filter
                         (lambda (template)
                           (let ((file (yas--template-load-file template)))
                             (and file
                                  (cl-some (lambda (dir)
                                             (string-prefix-p (expand-file-name dir) (expand-file-name file)))
                                           yas-snippet-dirs))))
                         choices))
           (snippets (mapcar (lambda (template)
                               (cons (yas--template-name template) template))
                             my-snippets)))
      (ivy-read "Snippet: " (mapcar #'car snippets)
                :action (lambda (snippet-name)
                          (let ((template (cdr (assoc snippet-name snippets))))
                            (when template
                              (yas-expand-snippet (yas--template-content template))))))))
  (global-set-key (kbd "C-c y") 'ivy-my-yasnippet)
#+end_src

* Typescript
#+begin_src emacs-lisp
  ;; Company mode setup
  (use-package company
    :ensure t
    :config
    (setq company-minimum-prefix-length 1)
    (setq company-idle-delay 0.0))  ;; Show suggestions immediately

  ;; TypeScript specific setup
  (use-package typescript-mode
    :ensure t
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))

  ;; Optional: setup lsp-ui for better UI
  (use-package lsp-ui
    :ensure t
    :commands lsp-ui-mode
    :config
    (setq lsp-ui-sideline-enable t)
    (setq lsp-ui-doc-enable t))
#+end_src

* LSP
#+begin_src emacs-lisp
  (defun my-filter-lsp-warnings (format-string &rest args)
    "Filter out specific lsp-mode warnings."
    (unless (string-match-p "Unknown request method: workspace/diagnostic/refresh" format-string)
      (apply #'message format-string args)))

  (advice-add 'lsp-warn :override #'my-filter-lsp-warnings)
#+end_src

* Julia LSP
#+BEGIN_SRC emacs-lisp
  (use-package vterm :ensure t)

  (use-package julia-mode
    :ensure t)

  (use-package julia-repl
    :ensure t
    :hook (julia-mode . julia-repl-mode)

    :init
    (setenv "JULIA_NUM_THREADS" "8")

    :config
    ;; Set the terminal backend
    (julia-repl-set-terminal-backend 'vterm)

    ;; Keybindings for quickly sending code to the REPL
    (define-key julia-repl-mode-map (kbd "<C-RET>") 'my/julia-repl-send-cell)
    (define-key julia-repl-mode-map (kbd "<M-RET>") 'julia-repl-send-line)
    (define-key julia-repl-mode-map (kbd "<S-return>") 'julia-repl-send-buffer))

  (use-package lsp-julia
    :config
    (setq lsp-julia-default-environment "~/.julia/environments/v1.10"))

  (add-hook 'julia-mode-hook #'lsp-mode)  
#+END_SRC

* Highlight Indent Guides
#+begin_src emacs-lisp
  (use-package highlight-indent-guides :ensure t)
  (setq highlight-indent-guides-auto-enabled nil)

  ;; Set the method to use character displays
  (setq highlight-indent-guides-method 'character)

  ;; Enable the mode in programming modes and web-mode
  (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
  (add-hook 'web-mode-hook 'highlight-indent-guides-mode)

  (setq highlight-indent-guides-responsive 'top)
  (setq highlight-indent-guides-delay 0)
  (set-face-foreground 'highlight-indent-guides-character-face "black")
  (set-face-foreground 'highlight-indent-guides-top-character-face "dimgray")  
#+end_src

* Caption
#+BEGIN_SRC emacs-lisp
  (defun my/org-html--format-image-caption (orig-func &rest args)
    (let ((caption (apply orig-func args)))
      (replace-regexp-in-string "Figure:" "Ábra:" caption)))

  (advice-add 'org-html--format-caption :around #'my/org-html--format-image-caption)
#+END_SRC
* Date
#+BEGIN_SRC emacs-lisp
  (defun ub/org-html-date ()
    "Current 'date' insertion. Format is YYYY. MM. DD."
    (interactive)
    (let ((current-date (format-time-string "%Y. %m. %d.")))
      (insert (format "#+BEGIN_EXPORT html\n<div class=\"date\">%s</div>\n#+END_EXPORT" current-date))))
#+END_SRC

* Hooks
#+BEGIN_SRC emacs-lisp
  (defun ubfuns/pretty-funs ()
    (writeroom-mode 1)
    (display-line-numbers-mode -1)
    (visual-line-mode 1))

  (defun ubfuns/dired-funs ()
    (dired-hide-details-mode t)
    (dired-omit-mode t))

  (add-hook 'org-mode-hook 'ubfuns/pretty-funs)

  (add-hook 'dired-mode-hook 'ubfuns/pretty-funs)
  (add-hook 'dired-mode-hook 'ubfuns/dired-funs)

  (add-hook 'term-mode-hook
            (lambda ()
              (company-mode -1)
              (display-line-numbers-mode -1)
              (lsp-mode -1)
              (hl-line-mode -1)
              ))

  (add-hook 'mhtml-mode-hook
            (lambda ()
              (display-line-numbers-mode 1)
              ))

  (add-hook 'css-mode-hook
            (lambda ()
              (display-line-numbers-mode 1)
              ))

  (add-hook 'c-mode-hook
            (lambda ()
              (display-line-numbers-mode 1)
              ))
  (add-hook 'prog-mode-hook
            (lambda ()
              (display-line-numbers-mode 1)
              ))  
#+END_SRC

* LaTeX engine
#+BEGIN_SRC emacs-lisp
  (setq TeX-engine 'xetex)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-s RET") 'eval-expression)
#+END_SRC
* Preceding expression
#+BEGIN_SRC emacs-lisp
  (defun eval-and-replace ()
    "Replace the preceding sexp with its value. Useful!"
    (interactive)
    (let ((value (eval (preceding-sexp))))
      (backward-kill-sexp)
      (insert (format "%s" value))))
  (global-set-key (kbd "C-x á") 'eval-and-replace)
  (global-set-key (kbd "M-é") 'backward-word)
  (global-set-key (kbd "M-á") 'forward-word)  
  #+END_SRC
