emacs/init.org
* TODO Tartalom
#+BEGIN_SRC todo
  ;;; org-tartalom.el --- Automated Tartalom (ToC) Generation for Org Mode -*- lexical-binding: t; -*-

  ;; Author: Your Name
  ;; Version: 1.0
  ;; Package-Requires: ((emacs "24.4") (org "9.1"))
  ;; Keywords: org, toc, toc, automation
  ;; URL: https://github.com/your-repo/org-tartalom

  ;;; Commentary:

  ;; This Emacs Lisp script automates the generation and updating of a custom
  ;; Table of Contents (ToC) named "Tartalom" in Org Mode files. It ensures that
  ;; each heading has a unique identifier and generates a hierarchical list
  ;; with clickable links. The "Tartalom" section is automatically inserted
  ;; after initial headers and updated whenever the document structure changes.

  ;;; Code:

  (require 'org)
  (require 'org-element)
  (require 'org-id)

  (defgroup org-tartalom nil
    "Automated Tartalom (ToC) generation for Org Mode."
    :prefix "org-tartalom-"
    :group 'org)

  (defcustom org-tartalom-title "Tartalom"
    "Title for the Table of Contents section."
    :type 'string
    :group 'org-tartalom)

  (defcustom org-tartalom-insert-after-regex "^#\\+TITLE\\|^#\\+AUTHOR\\|^#\\+EMAIL\\|^#\\+DATE\\|^#\\+DESCRIPTION"
    "Regex matching initial headers after which 'Tartalom' will be inserted.
  Adjust this regex to match all initial lines like #+TITLE, #+AUTHOR, etc."
    :type 'string
    :group 'org-tartalom)

  (defun org-tartalom-ensure-custom-ids ()
    "Ensure all headings in the current buffer have a CUSTOM_ID.

  If a heading does not have a CUSTOM_ID, generate one using `org-id-get-create'."
    (org-element-map (org-element-parse-buffer) 'headline
      (lambda (hl)
        (let ((props (org-element-property :properties hl)))
          (unless (org-element-property :CUSTOM_ID hl)
            (save-excursion
              (goto-char (org-element-property :begin hl))
              (org-id-get-create)))))))

  (defun org-tartalom-generate-toc ()
    "Generate the 'Tartalom' section based on current headings with CUSTOM_IDs.

  Returns the TOC as a string."
    (let* ((parsed (org-element-parse-buffer))
           (headlines (org-element-map parsed 'headline
                        (lambda (h)
                          (let ((level (org-element-property :level h))
                                (title (org-element-property :raw-value h))
                                (custom-id (org-element-property :CUSTOM_ID h)))
                            (when custom-id
                              (cons level (cons title custom-id)))))))
           (toc-lines
            (mapcar
             (lambda (hl)
               (let ((level (car hl))
                     (title (car (cdr hl)))
                     (custom-id (cdr (cdr hl))))
                 (concat
                  (make-string (* 2 (1- level)) ?\s)  ; Two spaces per level
                  "- [[" (concat "#" custom-id) "][" title "]]")))
             headlines))
           (toc-content (concat "* " org-tartalom-title "\n" (mapconcat 'identity toc-lines "\n"))))
      toc-content))

  (defun org-tartalom-insert-or-update ()
    "Insert or update the 'Tartalom' section in the current buffer."
    (interactive)
    (org-tartalom-ensure-custom-ids)
    (let ((toc (org-tartalom-generate-toc)))
      ;; Remove existing 'Tartalom' section if it exists
      (save-excursion
        (goto-char (point-min))
        (when (re-search-forward (concat "^\\*+ " (regexp-quote org-tartalom-title)) nil t)
          (let ((beg (match-beginning 0))
                (end (progn
                       (outline-next-heading)
                       (point))))
            (delete-region beg end))))
      ;; Insert the new 'Tartalom' at the appropriate position
      (save-excursion
        (goto-char (point-min))
        (if (re-search-forward org-tartalom-insert-after-regex nil t)
            (progn
              ;; Move to the end of the matched region
              (while (and (re-search-forward org-tartalom-insert-after-regex nil t)
                          (<= (point) (point-max))))
                (goto-char (match-end 0)))
              (insert "\n\n" toc "\n\n"))
          ;; If no initial headers matched, insert at the beginning
          (goto-char (point-min))
          (insert toc "\n\n"))))

  (defun org-tartalom-before-export-hook (backend)
    "Hook to generate 'Tartalom' before exporting.

  BACKEND is the export backend being used."
    (when (derived-mode-p 'org-mode)
      (org-tartalom-insert-or-update)))

  ;;;###autoload
  (defun org-tartalom-setup ()
    "Set up automated 'Tartalom' generation.

  This function adds necessary hooks to automate the insertion and updating
  of the 'Tartalom' section."
    (add-hook 'before-save-hook #'org-tartalom-insert-or-update nil t)
    (add-hook 'org-export-before-processing-hook #'org-tartalom-before-export-hook))

  ;;;###autoload
  (defun org-tartalom-teardown ()
    "Remove automated 'Tartalom' generation.

  This function removes the hooks added by `org-tartalom-setup`."
    (remove-hook 'before-save-hook #'org-tartalom-insert-or-update t)
    (remove-hook 'org-export-before-processing-hook #'org-tartalom-before-export-hook))

  ;;;###autoload
  (add-hook 'org-mode-hook #'org-tartalom-setup)

  (provide 'org-tartalom)

  ;;; org-tartalom.el ends here

#+END_SRC

* Export to init.el
This block will convert all org-babel code blocks to a plain `init.el`.
#+begin_src emacs-lisp :exports none
  (setq org-confirm-babel-evaluate nil)  
  (org-babel-tangle-file "init.org" "init.el" "emacs-lisp")
#+end_src

#+RESULTS:
| /home/anon/.emacs.d/init.el |
