emacs/init.el

(setq org-confirm-babel-evaluate nil)  
(org-babel-tangle-file "init.org" "init.el" "emacs-lisp")
